app/controllers/books_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
	def show
		@book = Book.find(params[:id])
		@newbook = Book.new
		@user = User.find(@book.user_id)

INSERT INTO "books" ("created_at", "updated_at", "title", "body", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2020-07-20 18:59:37.613719"], ["updated_at", "2020-07-20 18:59:37.613719"], ["title", "ffff"], ["body", "fffffff"], ["user_id", 12]]
SELECT "books".* FROM "books"
---
	def create
		@book = Book.new(book_params)
		@book.user_id = current_user.id
		if @book.save
			redirect_to book_path(@book)
			flash[:notice] = "Book was successfully created."
		else
			@books = Book.all

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
  def corrent_user
    @book = Book.find(params[:id])