app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 5]]
---
  def show
      @user = User.find(params[:id])
      @newbook = Book.new
      @books = @user.books.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "introduction" = ?, "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "dd"], ["introduction", "ffff"], ["profile_image_id", nil], ["updated_at", "2020-07-20 18:35:26.156698"], ["id", 1]]
---
  def update
      @user = User.find(params[:id])
      if @user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def corrent_user
    @user = User.find(params[:id])